function check_results()
% Значения для сигнала 3-ей степени потери слуха
% p_1 = [0 96];
% p_2 = [0 94];
% p_3 = [4 94];
% p_4 = [6 88];
% p_5 = [4 98];
% p_6 = [6 92];
% p_7 = [0 96];
% p_8 = [2 98];
% p_9 = [0 88];
% p_10 = [0 98];
% p_11 = [4 90];
% p_12 = [2 88];
% p_13 = [6 98];
% p_14 = [4 94];
% p_15 = [2 92];

% Значения для сигнала 2-ой степени потери слуха
p_1 = [20 100];
p_2 = [28 98];
p_3 = [30 92];
p_4 = [42 88];
p_5 = [24 90];
p_6 = [20 98];
p_7 = [16 98];
p_8 = [6 94];
p_9 = [4 96];
p_10 = [10 98];
p_11 = [12 94];
p_12 = [4 92];
p_13 = [24 100];
p_14 = [32 100];
p_15 = [14 96];

res = [p_1;p_2;p_3;p_4;p_5;p_6;p_7;p_8;p_9;p_10;p_11;p_12;p_13;p_14;p_15];
dif_1 = p_1(2) - p_1(1);
dif_2 = p_2(2) - p_2(1);
dif_3 = p_3(2) - p_3(1);
dif_4 = p_4(2) - p_4(1);
dif_5 = p_5(2) - p_5(1);
dif_6 = p_6(2) - p_6(1);
dif_7 = p_7(2) - p_7(1);
dif_8 = p_8(2) - p_8(1);
dif_9 = p_9(2) - p_9(1);
dif_10 = p_10(2) - p_10(1);
dif_11 = p_11(2) - p_11(1);
dif_12 = p_12(2) - p_12(1);
dif_13 = p_13(2) - p_13(1);
dif_14 = p_14(2) - p_14(1);
dif_15 = p_15(2) - p_15(1);

dif = dif_1 + dif_2 + dif_3 + dif_4 + dif_5 + dif_6 + dif_7 + dif_8 + dif_9 + dif_10 + dif_11 + dif_12 + dif_13 + dif_14 + dif_15;
dif = dif/15;
min_dif = min ([dif_1 dif_2 dif_3 dif_4 dif_5 dif_6 dif_7 dif_8 dif_9 dif_10 dif_11 dif_12 dif_13 dif_14 dif_15]);
max_dif = max ([dif_1 dif_2 dif_3 dif_4 dif_5 dif_6 dif_7 dif_8 dif_9 dif_10 dif_11 dif_12 dif_13 dif_14 dif_15]);

disp ('Средний прирост разборчивости = ' + string(dif) + ' %');
disp ('Минимальный процент разборчивости = ' + string(min_dif) + ' %');
disp ('Максимальный процент разборчивости = ' + string(max_dif) + ' %');


figure;
bar(res);
xlabel ('Участник');
ylim ([0 112]);
xlim ([0.5 15.5]);
ylabel('Процент разборчиовсти');
legend ('С моделированием 2-ой степени потери слуха', 'С коррекцией слуха');

figure;
bar(res);
xlabel ('Участник');
ylim ([0 112]);
xlim ([0.5 15.5]);
ylabel('Процент разборчиовсти');
legend ('С моделированием 3-ей степени потери слуха', 'С коррекцией слуха');

alpha = 0.05;
X = [p_1(1) p_2(1) p_3(1) p_4(1) p_5(1) p_6(1) p_7(1) p_8(1) p_9(1) p_10(1) p_11(1) p_12(1) p_13(1) p_14(1) p_15(1)];
Y = [p_1(2) p_2(2) p_3(2) p_4(2) p_5(2) p_6(2) p_7(2) p_8(2) p_9(2) p_10(2) p_11(2) p_12(2) p_13(2) p_14(2) p_15(2)];
[H,p] = ttest(X, Y,'Alpha',alpha)
end

